# n = 4
# n += 4
# m = 'ура'
# print(f'He\tl\\lo {n} Mir!', end='')
# print("ре\зул\nь\nт\nат:", n, sep='')
# # тяжело-тяжело, но мы сильные и все получиться
print(102+4)
print('Результат остатка', 233234324 % 3545) # Остаток
print('Результат:', 5 ** 4) # Возведение в степень
print(f"Результат деления: {43 // 4}") #Убирает знаки после запятой БЕЗ ОКРУГЛЕНИЯ
print(f"Результат деления: {43 / 4}")
print(f"Результат деления: {round(43 / 4)}") # Округление к ближайшему
print(min(233423, 765456, 34, 23453, 4, -1)) # ищет минимальное значение
print(max(233423, 765456, 34, 23453, 4, -1)) # ищет максимальное значение
print(abs(-243)) # ищет число по модулю
print(pow(2, 4)) # еще один способ возвести в степень
print(2 ** 4)

number = 4
print(number)
del number

digit = 43333333333333
word = "Результат: "
print(word + str(digit), sep= '\n\n')
name =  "Masha"
print(f'Привет я {name=}')
print(f'Привет я {name}')

value = 21.5678

print(f'{value:.2f}')




